#ifndef __CONFIG_H__
#define __CONFIG_H__

/*******************************************************************************
 *** DEFENITIONS
 ******************************************************************************/
#define  NUM_RELAY_O         (0)  // количество relay объектов
#define  NUM_SW_O            (0)  // количество sw объектов
#define  NUM_SW_RELAY_O      (0)  // количество sw-relay объектов
#define  NUM_BT_O            (0)  // количество bt объектов
#define  NUM_BT_RELAY_O      (2)  // количество bt-relay объектов

/*******************************************************************************
 *** COMMON TYPEDEF
 ******************************************************************************/
typedef struct
{
	int in;
	int out;
} in_out_t;

/*******************************************************************************
 *** EXTERN VARIABLES
 ******************************************************************************/
extern in_out_t bt_relay_pin_map[NUM_BT_RELAY_O];

#endif  // __CONFIG_H__
